#### Outcome: 🟨  add=0 change=1 destroy=0
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```\n
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
Using KUBECONFIG_TEXT to create /tmp/talosconfig
[32m[1mSuccess![0m The configuration is valid.[0m
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
Using KUBECONFIG_TEXT to create /tmp/talosconfig

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

# # helm_release.cilium_config will be updated in-place
! ~ resource "helm_release" "cilium_config" {
+       id                         = "cilium-config"
!     ~ metadata                   = {
!         ~ app_version    = "1.0" -> (known after apply)
!         ~ chart          = "cilium-config" -> (known after apply)
!         ~ first_deployed = 1766313232 -> (known after apply)
!         ~ last_deployed  = 1767015556 -> (known after apply)
!         ~ name           = "cilium-config" -> (known after apply)
!         ~ namespace      = "kube-system" -> (known after apply)
!         ~ notes          = "" -> (known after apply)
!         ~ revision       = 8 -> (known after apply)
!         ~ values         = jsonencode(
+               {
-                 - gateway      = {
-                     - CIDRs = [
-                         - "2a12:bec4:1821::1/128",
+                       ]
+                   }
-                 - loadBalancer = {
-                     - defaultCIDRs   = [
-                         - "2a12:bec4:1821:3ed:bad1:c0de:300:0/112",
+                       ]
-                     - dualstackCIDRs = []
+                   }
+               }
+           ) -> (known after apply)
!         ~ version        = "0.1.3" -> (known after apply)
+       } -> (known after apply)
+       name                       = "cilium-config"
!     ~ set_wo                     = (write-only attribute)
!     ~ version                    = "0.1.3" -> "0.1.4"
#       # (28 unchanged attributes hidden)
+   }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @ryan-kraay-sigstore, Action: `pull_request`, Working Directory: ``, Workflow: `Full CI/CD Pipeline`*`;
<!-- Sticky Pull Request Commentdevelopment-k8s -->